espressif/esp-idf/components/soc/esp32c5/register/soc/lp_tee_reg.h
/** LP_TEE_LP_ANA_PERI_CTRL_REG register
 *  LP_ANA_PERI read/write control register
 */
#define LP_TEE_LP_ANA_PERI_CTRL_REG (DR_REG_LP_TEE_BASE + 0x20)
/** LP_TEE_READ_TEE_LP_ANA_PERI : R/W; bitpos: [0]; default: 1;
 *  Configures lp_ana_peri registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_ANA_PERI    (BIT(0))
#define LP_TEE_READ_TEE_LP_ANA_PERI_M  (LP_TEE_READ_TEE_LP_ANA_PERI_V << LP_TEE_READ_TEE_LP_ANA_PERI_S)
#define LP_TEE_READ_TEE_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_TEE_LP_ANA_PERI_S  0
/** LP_TEE_READ_REE0_LP_ANA_PERI : R/W; bitpos: [1]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_ANA_PERI    (BIT(1))
#define LP_TEE_READ_REE0_LP_ANA_PERI_M  (LP_TEE_READ_REE0_LP_ANA_PERI_V << LP_TEE_READ_REE0_LP_ANA_PERI_S)
#define LP_TEE_READ_REE0_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE0_LP_ANA_PERI_S  1
/** LP_TEE_READ_REE1_LP_ANA_PERI : R/W; bitpos: [2]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_ANA_PERI    (BIT(2))
#define LP_TEE_READ_REE1_LP_ANA_PERI_M  (LP_TEE_READ_REE1_LP_ANA_PERI_V << LP_TEE_READ_REE1_LP_ANA_PERI_S)
#define LP_TEE_READ_REE1_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE1_LP_ANA_PERI_S  2
/** LP_TEE_READ_REE2_LP_ANA_PERI : R/W; bitpos: [3]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_ANA_PERI    (BIT(3))
#define LP_TEE_READ_REE2_LP_ANA_PERI_M  (LP_TEE_READ_REE2_LP_ANA_PERI_V << LP_TEE_READ_REE2_LP_ANA_PERI_S)
#define LP_TEE_READ_REE2_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE2_LP_ANA_PERI_S  3
/** LP_TEE_WRITE_TEE_LP_ANA_PERI : R/W; bitpos: [4]; default: 1;
 *  Configures lp_ana_peri registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_ANA_PERI    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_M  (LP_TEE_WRITE_TEE_LP_ANA_PERI_V << LP_TEE_WRITE_TEE_LP_ANA_PERI_S)
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_S  4
/** LP_TEE_WRITE_REE0_LP_ANA_PERI : R/W; bitpos: [5]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_ANA_PERI    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_M  (LP_TEE_WRITE_REE0_LP_ANA_PERI_V << LP_TEE_WRITE_REE0_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_S  5
/** LP_TEE_WRITE_REE1_LP_ANA_PERI : R/W; bitpos: [6]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_ANA_PERI    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_M  (LP_TEE_WRITE_REE1_LP_ANA_PERI_V << LP_TEE_WRITE_REE1_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_S  6
/** LP_TEE_WRITE_REE2_LP_ANA_PERI : R/W; bitpos: [7]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_ANA_PERI    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_M  (LP_TEE_WRITE_REE2_LP_ANA_PERI_V << LP_TEE_WRITE_REE2_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_S  7

/** LP_TEE_LP_IO_CTRL_REG register
 *  LP_GPIO and LP_IO_MUX read/write control register
 */
#define LP_TEE_LP_IO_CTRL_REG (DR_REG_LP_TEE_BASE + 0x2c)
/** LP_TEE_READ_TEE_LP_IO : R/W; bitpos: [0]; default: 1;
 *  Configures lp_io registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_IO    (BIT(0))
#define LP_TEE_READ_TEE_LP_IO_M  (LP_TEE_READ_TEE_LP_IO_V << LP_TEE_READ_TEE_LP_IO_S)
#define LP_TEE_READ_TEE_LP_IO_V  0x00000001U
#define LP_TEE_READ_TEE_LP_IO_S  0
/** LP_TEE_READ_REE0_LP_IO : R/W; bitpos: [1]; default: 0;
 *  Configures lp_io registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_IO    (BIT(1))
#define LP_TEE_READ_REE0_LP_IO_M  (LP_TEE_READ_REE0_LP_IO_V << LP_TEE_READ_REE0_LP_IO_S)
#define LP_TEE_READ_REE0_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE0_LP_IO_S  1
/** LP_TEE_READ_REE1_LP_IO : R/W; bitpos: [2]; default: 0;
 *  Configures lp_io registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_IO    (BIT(2))
#define LP_TEE_READ_REE1_LP_IO_M  (LP_TEE_READ_REE1_LP_IO_V << LP_TEE_READ_REE1_LP_IO_S)
#define LP_TEE_READ_REE1_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE1_LP_IO_S  2
/** LP_TEE_READ_REE2_LP_IO : R/W; bitpos: [3]; default: 0;
 *  Configures lp_io registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_IO    (BIT(3))
#define LP_TEE_READ_REE2_LP_IO_M  (LP_TEE_READ_REE2_LP_IO_V << LP_TEE_READ_REE2_LP_IO_S)
#define LP_TEE_READ_REE2_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE2_LP_IO_S  3
/** LP_TEE_WRITE_TEE_LP_IO : R/W; bitpos: [4]; default: 1;
 *  Configures lp_io registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_IO    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_IO_M  (LP_TEE_WRITE_TEE_LP_IO_V << LP_TEE_WRITE_TEE_LP_IO_S)
#define LP_TEE_WRITE_TEE_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_IO_S  4
/** LP_TEE_WRITE_REE0_LP_IO : R/W; bitpos: [5]; default: 0;
 *  Configures lp_io registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_IO    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_IO_M  (LP_TEE_WRITE_REE0_LP_IO_V << LP_TEE_WRITE_REE0_LP_IO_S)
#define LP_TEE_WRITE_REE0_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_IO_S  5
/** LP_TEE_WRITE_REE1_LP_IO : R/W; bitpos: [6]; default: 0;
 *  Configures lp_io registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_IO    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_IO_M  (LP_TEE_WRITE_REE1_LP_IO_V << LP_TEE_WRITE_REE1_LP_IO_S)
#define LP_TEE_WRITE_REE1_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_IO_S  6
/** LP_TEE_WRITE_REE2_LP_IO : R/W; bitpos: [7]; default: 0;
 *  Configures lp_io registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_IO    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_IO_M  (LP_TEE_WRITE_REE2_LP_IO_V << LP_TEE_WRITE_REE2_LP_IO_S)
#define LP_TEE_WRITE_REE2_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_IO_S  7

/** LP_TEE_LP_TEE_CTRL_REG register
 *  LP_TEE read/write control register
 */
#define LP_TEE_LP_TEE_CTRL_REG (DR_REG_LP_TEE_BASE + 0x34)
/** LP_TEE_READ_TEE_LP_TEE : R/W; bitpos: [0]; default: 1;
 *  Configures lp_tee registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_TEE    (BIT(0))
#define LP_TEE_READ_TEE_LP_TEE_M  (LP_TEE_READ_TEE_LP_TEE_V << LP_TEE_READ_TEE_LP_TEE_S)
#define LP_TEE_READ_TEE_LP_TEE_V  0x00000001U
#define LP_TEE_READ_TEE_LP_TEE_S  0
/** LP_TEE_READ_REE0_LP_TEE : HRO; bitpos: [1]; default: 0;
 *  Configures lp_tee registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_TEE    (BIT(1))
#define LP_TEE_READ_REE0_LP_TEE_M  (LP_TEE_READ_REE0_LP_TEE_V << LP_TEE_READ_REE0_LP_TEE_S)
#define LP_TEE_READ_REE0_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE0_LP_TEE_S  1
/** LP_TEE_READ_REE1_LP_TEE : HRO; bitpos: [2]; default: 0;
 *  Configures lp_tee registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_TEE    (BIT(2))
#define LP_TEE_READ_REE1_LP_TEE_M  (LP_TEE_READ_REE1_LP_TEE_V << LP_TEE_READ_REE1_LP_TEE_S)
#define LP_TEE_READ_REE1_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE1_LP_TEE_S  2
/** LP_TEE_READ_REE2_LP_TEE : HRO; bitpos: [3]; default: 0;
 *  Configures lp_tee registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_TEE    (BIT(3))
#define LP_TEE_READ_REE2_LP_TEE_M  (LP_TEE_READ_REE2_LP_TEE_V << LP_TEE_READ_REE2_LP_TEE_S)
#define LP_TEE_READ_REE2_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE2_LP_TEE_S  3
/** LP_TEE_WRITE_TEE_LP_TEE : R/W; bitpos: [4]; default: 1;
 *  Configures lp_tee registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_TEE    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_TEE_M  (LP_TEE_WRITE_TEE_LP_TEE_V << LP_TEE_WRITE_TEE_LP_TEE_S)
#define LP_TEE_WRITE_TEE_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_TEE_S  4
/** LP_TEE_WRITE_REE0_LP_TEE : HRO; bitpos: [5]; default: 0;
 *  Configures lp_tee registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_TEE    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_TEE_M  (LP_TEE_WRITE_REE0_LP_TEE_V << LP_TEE_WRITE_REE0_LP_TEE_S)
#define LP_TEE_WRITE_REE0_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_TEE_S  5
/** LP_TEE_WRITE_REE1_LP_TEE : HRO; bitpos: [6]; default: 0;
 *  Configures lp_tee registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_TEE    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_TEE_M  (LP_TEE_WRITE_REE1_LP_TEE_V << LP_TEE_WRITE_REE1_LP_TEE_S)
#define LP_TEE_WRITE_REE1_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_TEE_S  6
/** LP_TEE_WRITE_REE2_LP_TEE : HRO; bitpos: [7]; default: 0;
 *  Configures lp_tee registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_TEE    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_TEE_M  (LP_TEE_WRITE_REE2_LP_TEE_V << LP_TEE_WRITE_REE2_LP_TEE_S)
#define LP_TEE_WRITE_REE2_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_TEE_S  7

/** LP_TEE_UART_CTRL_REG register
 *  LP_UART read/write control register
 */
#define LP_TEE_UART_CTRL_REG (DR_REG_LP_TEE_BASE + 0x38)
/** LP_TEE_READ_TEE_UART : R/W; bitpos: [0]; default: 1;
 *  Configures uart registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_UART    (BIT(0))
#define LP_TEE_READ_TEE_UART_M  (LP_TEE_READ_TEE_UART_V << LP_TEE_READ_TEE_UART_S)
#define LP_TEE_READ_TEE_UART_V  0x00000001U
#define LP_TEE_READ_TEE_UART_S  0
/** LP_TEE_READ_REE0_UART : R/W; bitpos: [1]; default: 0;
 *  Configures uart registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_UART    (BIT(1))
#define LP_TEE_READ_REE0_UART_M  (LP_TEE_READ_REE0_UART_V << LP_TEE_READ_REE0_UART_S)
#define LP_TEE_READ_REE0_UART_V  0x00000001U
#define LP_TEE_READ_REE0_UART_S  1
/** LP_TEE_READ_REE1_UART : R/W; bitpos: [2]; default: 0;
 *  Configures uart registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_UART    (BIT(2))
#define LP_TEE_READ_REE1_UART_M  (LP_TEE_READ_REE1_UART_V << LP_TEE_READ_REE1_UART_S)
#define LP_TEE_READ_REE1_UART_V  0x00000001U
#define LP_TEE_READ_REE1_UART_S  2
/** LP_TEE_READ_REE2_UART : R/W; bitpos: [3]; default: 0;
 *  Configures uart registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_UART    (BIT(3))
#define LP_TEE_READ_REE2_UART_M  (LP_TEE_READ_REE2_UART_V << LP_TEE_READ_REE2_UART_S)
#define LP_TEE_READ_REE2_UART_V  0x00000001U
#define LP_TEE_READ_REE2_UART_S  3
/** LP_TEE_WRITE_TEE_UART : R/W; bitpos: [4]; default: 1;
 *  Configures uart registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_UART    (BIT(4))
#define LP_TEE_WRITE_TEE_UART_M  (LP_TEE_WRITE_TEE_UART_V << LP_TEE_WRITE_TEE_UART_S)
#define LP_TEE_WRITE_TEE_UART_V  0x00000001U
#define LP_TEE_WRITE_TEE_UART_S  4
/** LP_TEE_WRITE_REE0_UART : R/W; bitpos: [5]; default: 0;
 *  Configures uart registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_UART    (BIT(5))
#define LP_TEE_WRITE_REE0_UART_M  (LP_TEE_WRITE_REE0_UART_V << LP_TEE_WRITE_REE0_UART_S)
#define LP_TEE_WRITE_REE0_UART_V  0x00000001U
#define LP_TEE_WRITE_REE0_UART_S  5
/** LP_TEE_WRITE_REE1_UART : R/W; bitpos: [6]; default: 0;
 *  Configures uart registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_UART    (BIT(6))
#define LP_TEE_WRITE_REE1_UART_M  (LP_TEE_WRITE_REE1_UART_V << LP_TEE_WRITE_REE1_UART_S)
#define LP_TEE_WRITE_REE1_UART_V  0x00000001U
#define LP_TEE_WRITE_REE1_UART_S  6
/** LP_TEE_WRITE_REE2_UART : R/W; bitpos: [7]; default: 0;
 *  Configures uart registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_UART    (BIT(7))
#define LP_TEE_WRITE_REE2_UART_M  (LP_TEE_WRITE_REE2_UART_V << LP_TEE_WRITE_REE2_UART_S)
#define LP_TEE_WRITE_REE2_UART_V  0x00000001U
#define LP_TEE_WRITE_REE2_UART_S  7

