espressif/esp-idf/components/soc/esp32c5/register/soc/lp_tee_reg.h
/** LP_TEE_I2C_EXT_CTRL_REG register
 *  LP_I2C read/write control register
 */
#define LP_TEE_I2C_EXT_CTRL_REG (DR_REG_LP_TEE_BASE + 0x40)
/** LP_TEE_READ_TEE_I2C_EXT : R/W; bitpos: [0]; default: 1;
 *  Configures i2c_ext registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_I2C_EXT    (BIT(0))
#define LP_TEE_READ_TEE_I2C_EXT_M  (LP_TEE_READ_TEE_I2C_EXT_V << LP_TEE_READ_TEE_I2C_EXT_S)
#define LP_TEE_READ_TEE_I2C_EXT_V  0x00000001U
#define LP_TEE_READ_TEE_I2C_EXT_S  0
/** LP_TEE_READ_REE0_I2C_EXT : R/W; bitpos: [1]; default: 0;
 *  Configures i2c_ext registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_I2C_EXT    (BIT(1))
#define LP_TEE_READ_REE0_I2C_EXT_M  (LP_TEE_READ_REE0_I2C_EXT_V << LP_TEE_READ_REE0_I2C_EXT_S)
#define LP_TEE_READ_REE0_I2C_EXT_V  0x00000001U
#define LP_TEE_READ_REE0_I2C_EXT_S  1
/** LP_TEE_READ_REE1_I2C_EXT : R/W; bitpos: [2]; default: 0;
 *  Configures i2c_ext registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_I2C_EXT    (BIT(2))
#define LP_TEE_READ_REE1_I2C_EXT_M  (LP_TEE_READ_REE1_I2C_EXT_V << LP_TEE_READ_REE1_I2C_EXT_S)
#define LP_TEE_READ_REE1_I2C_EXT_V  0x00000001U
#define LP_TEE_READ_REE1_I2C_EXT_S  2
/** LP_TEE_READ_REE2_I2C_EXT : R/W; bitpos: [3]; default: 0;
 *  Configures i2c_ext registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_I2C_EXT    (BIT(3))
#define LP_TEE_READ_REE2_I2C_EXT_M  (LP_TEE_READ_REE2_I2C_EXT_V << LP_TEE_READ_REE2_I2C_EXT_S)
#define LP_TEE_READ_REE2_I2C_EXT_V  0x00000001U
#define LP_TEE_READ_REE2_I2C_EXT_S  3
/** LP_TEE_WRITE_TEE_I2C_EXT : R/W; bitpos: [4]; default: 1;
 *  Configures i2c_ext registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_I2C_EXT    (BIT(4))
#define LP_TEE_WRITE_TEE_I2C_EXT_M  (LP_TEE_WRITE_TEE_I2C_EXT_V << LP_TEE_WRITE_TEE_I2C_EXT_S)
#define LP_TEE_WRITE_TEE_I2C_EXT_V  0x00000001U
#define LP_TEE_WRITE_TEE_I2C_EXT_S  4
/** LP_TEE_WRITE_REE0_I2C_EXT : R/W; bitpos: [5]; default: 0;
 *  Configures i2c_ext registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_I2C_EXT    (BIT(5))
#define LP_TEE_WRITE_REE0_I2C_EXT_M  (LP_TEE_WRITE_REE0_I2C_EXT_V << LP_TEE_WRITE_REE0_I2C_EXT_S)
#define LP_TEE_WRITE_REE0_I2C_EXT_V  0x00000001U
#define LP_TEE_WRITE_REE0_I2C_EXT_S  5
/** LP_TEE_WRITE_REE1_I2C_EXT : R/W; bitpos: [6]; default: 0;
 *  Configures i2c_ext registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_I2C_EXT    (BIT(6))
#define LP_TEE_WRITE_REE1_I2C_EXT_M  (LP_TEE_WRITE_REE1_I2C_EXT_V << LP_TEE_WRITE_REE1_I2C_EXT_S)
#define LP_TEE_WRITE_REE1_I2C_EXT_V  0x00000001U
#define LP_TEE_WRITE_REE1_I2C_EXT_S  6
/** LP_TEE_WRITE_REE2_I2C_EXT : R/W; bitpos: [7]; default: 0;
 *  Configures i2c_ext registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_I2C_EXT    (BIT(7))
#define LP_TEE_WRITE_REE2_I2C_EXT_M  (LP_TEE_WRITE_REE2_I2C_EXT_V << LP_TEE_WRITE_REE2_I2C_EXT_S)
#define LP_TEE_WRITE_REE2_I2C_EXT_V  0x00000001U
#define LP_TEE_WRITE_REE2_I2C_EXT_S  7

/** LP_TEE_I2C_ANA_MST_CTRL_REG register
 *  I2C_ANA_MST read/write control register
 */
#define LP_TEE_I2C_ANA_MST_CTRL_REG (DR_REG_LP_TEE_BASE + 0x44)
/** LP_TEE_READ_TEE_I2C_ANA_MST : R/W; bitpos: [0]; default: 1;
 *  Configures i2c_ana_mst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_I2C_ANA_MST    (BIT(0))
#define LP_TEE_READ_TEE_I2C_ANA_MST_M  (LP_TEE_READ_TEE_I2C_ANA_MST_V << LP_TEE_READ_TEE_I2C_ANA_MST_S)
#define LP_TEE_READ_TEE_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_READ_TEE_I2C_ANA_MST_S  0
/** LP_TEE_READ_REE0_I2C_ANA_MST : R/W; bitpos: [1]; default: 0;
 *  Configures i2c_ana_mst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_I2C_ANA_MST    (BIT(1))
#define LP_TEE_READ_REE0_I2C_ANA_MST_M  (LP_TEE_READ_REE0_I2C_ANA_MST_V << LP_TEE_READ_REE0_I2C_ANA_MST_S)
#define LP_TEE_READ_REE0_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_READ_REE0_I2C_ANA_MST_S  1
/** LP_TEE_READ_REE1_I2C_ANA_MST : R/W; bitpos: [2]; default: 0;
 *  Configures i2c_ana_mst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_I2C_ANA_MST    (BIT(2))
#define LP_TEE_READ_REE1_I2C_ANA_MST_M  (LP_TEE_READ_REE1_I2C_ANA_MST_V << LP_TEE_READ_REE1_I2C_ANA_MST_S)
#define LP_TEE_READ_REE1_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_READ_REE1_I2C_ANA_MST_S  2
/** LP_TEE_READ_REE2_I2C_ANA_MST : R/W; bitpos: [3]; default: 0;
 *  Configures i2c_ana_mst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_I2C_ANA_MST    (BIT(3))
#define LP_TEE_READ_REE2_I2C_ANA_MST_M  (LP_TEE_READ_REE2_I2C_ANA_MST_V << LP_TEE_READ_REE2_I2C_ANA_MST_S)
#define LP_TEE_READ_REE2_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_READ_REE2_I2C_ANA_MST_S  3
/** LP_TEE_WRITE_TEE_I2C_ANA_MST : R/W; bitpos: [4]; default: 1;
 *  Configures i2c_ana_mst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_I2C_ANA_MST    (BIT(4))
#define LP_TEE_WRITE_TEE_I2C_ANA_MST_M  (LP_TEE_WRITE_TEE_I2C_ANA_MST_V << LP_TEE_WRITE_TEE_I2C_ANA_MST_S)
#define LP_TEE_WRITE_TEE_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_WRITE_TEE_I2C_ANA_MST_S  4
/** LP_TEE_WRITE_REE0_I2C_ANA_MST : R/W; bitpos: [5]; default: 0;
 *  Configures i2c_ana_mst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_I2C_ANA_MST    (BIT(5))
#define LP_TEE_WRITE_REE0_I2C_ANA_MST_M  (LP_TEE_WRITE_REE0_I2C_ANA_MST_V << LP_TEE_WRITE_REE0_I2C_ANA_MST_S)
#define LP_TEE_WRITE_REE0_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_WRITE_REE0_I2C_ANA_MST_S  5
/** LP_TEE_WRITE_REE1_I2C_ANA_MST : R/W; bitpos: [6]; default: 0;
 *  Configures i2c_ana_mst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_I2C_ANA_MST    (BIT(6))
#define LP_TEE_WRITE_REE1_I2C_ANA_MST_M  (LP_TEE_WRITE_REE1_I2C_ANA_MST_V << LP_TEE_WRITE_REE1_I2C_ANA_MST_S)
#define LP_TEE_WRITE_REE1_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_WRITE_REE1_I2C_ANA_MST_S  6
/** LP_TEE_WRITE_REE2_I2C_ANA_MST : R/W; bitpos: [7]; default: 0;
 *  Configures i2c_ana_mst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_I2C_ANA_MST    (BIT(7))
#define LP_TEE_WRITE_REE2_I2C_ANA_MST_M  (LP_TEE_WRITE_REE2_I2C_ANA_MST_V << LP_TEE_WRITE_REE2_I2C_ANA_MST_S)
#define LP_TEE_WRITE_REE2_I2C_ANA_MST_V  0x00000001U
#define LP_TEE_WRITE_REE2_I2C_ANA_MST_S  7

/** LP_TEE_LP_APM_CTRL_REG register
 *  LP_APM read/write control register
 */
#define LP_TEE_LP_APM_CTRL_REG (DR_REG_LP_TEE_BASE + 0x4c)
/** LP_TEE_READ_TEE_LP_APM : R/W; bitpos: [0]; default: 1;
 *  Configures lp_apm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_APM    (BIT(0))
#define LP_TEE_READ_TEE_LP_APM_M  (LP_TEE_READ_TEE_LP_APM_V << LP_TEE_READ_TEE_LP_APM_S)
#define LP_TEE_READ_TEE_LP_APM_V  0x00000001U
#define LP_TEE_READ_TEE_LP_APM_S  0
/** LP_TEE_READ_REE0_LP_APM : HRO; bitpos: [1]; default: 0;
 *  Configures lp_apm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_APM    (BIT(1))
#define LP_TEE_READ_REE0_LP_APM_M  (LP_TEE_READ_REE0_LP_APM_V << LP_TEE_READ_REE0_LP_APM_S)
#define LP_TEE_READ_REE0_LP_APM_V  0x00000001U
#define LP_TEE_READ_REE0_LP_APM_S  1
/** LP_TEE_READ_REE1_LP_APM : HRO; bitpos: [2]; default: 0;
 *  Configures lp_apm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_APM    (BIT(2))
#define LP_TEE_READ_REE1_LP_APM_M  (LP_TEE_READ_REE1_LP_APM_V << LP_TEE_READ_REE1_LP_APM_S)
#define LP_TEE_READ_REE1_LP_APM_V  0x00000001U
#define LP_TEE_READ_REE1_LP_APM_S  2
/** LP_TEE_READ_REE2_LP_APM : HRO; bitpos: [3]; default: 0;
 *  Configures lp_apm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_APM    (BIT(3))
#define LP_TEE_READ_REE2_LP_APM_M  (LP_TEE_READ_REE2_LP_APM_V << LP_TEE_READ_REE2_LP_APM_S)
#define LP_TEE_READ_REE2_LP_APM_V  0x00000001U
#define LP_TEE_READ_REE2_LP_APM_S  3
/** LP_TEE_WRITE_TEE_LP_APM : R/W; bitpos: [4]; default: 1;
 *  Configures lp_apm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_APM    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_APM_M  (LP_TEE_WRITE_TEE_LP_APM_V << LP_TEE_WRITE_TEE_LP_APM_S)
#define LP_TEE_WRITE_TEE_LP_APM_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_APM_S  4
/** LP_TEE_WRITE_REE0_LP_APM : HRO; bitpos: [5]; default: 0;
 *  Configures lp_apm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_APM    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_APM_M  (LP_TEE_WRITE_REE0_LP_APM_V << LP_TEE_WRITE_REE0_LP_APM_S)
#define LP_TEE_WRITE_REE0_LP_APM_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_APM_S  5
/** LP_TEE_WRITE_REE1_LP_APM : HRO; bitpos: [6]; default: 0;
 *  Configures lp_apm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_APM    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_APM_M  (LP_TEE_WRITE_REE1_LP_APM_V << LP_TEE_WRITE_REE1_LP_APM_S)
#define LP_TEE_WRITE_REE1_LP_APM_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_APM_S  6
/** LP_TEE_WRITE_REE2_LP_APM : HRO; bitpos: [7]; default: 0;
 *  Configures lp_apm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_APM    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_APM_M  (LP_TEE_WRITE_REE2_LP_APM_V << LP_TEE_WRITE_REE2_LP_APM_S)
#define LP_TEE_WRITE_REE2_LP_APM_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_APM_S  7

/** LP_TEE_FORCE_ACC_HP_REG register
 *  Force access to HP SRAM configuration register
 */
#define LP_TEE_FORCE_ACC_HP_REG (DR_REG_LP_TEE_BASE + 0x90)
/** LP_TEE_FORCE_ACC_HPMEM_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to allow LP CPU to forcibly access HP SRAM regardless of
 *  permission management.
 *  0: Disable force access to HP SRAM
 *  1: Enable force access to HP SRAM
 */
#define LP_TEE_FORCE_ACC_HPMEM_EN    (BIT(0))
#define LP_TEE_FORCE_ACC_HPMEM_EN_M  (LP_TEE_FORCE_ACC_HPMEM_EN_V << LP_TEE_FORCE_ACC_HPMEM_EN_S)
#define LP_TEE_FORCE_ACC_HPMEM_EN_V  0x00000001U
#define LP_TEE_FORCE_ACC_HPMEM_EN_S  0

/** LP_TEE_BUS_ERR_CONF_REG register
 *  Error message return configuration register
 */
#define LP_TEE_BUS_ERR_CONF_REG (DR_REG_LP_TEE_BASE + 0xf0)
/** LP_TEE_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to return error message to CPU when access is blocked.
 *  0: Disable
 *  1: Enable
 */
#define LP_TEE_BUS_ERR_RESP_EN    (BIT(0))
#define LP_TEE_BUS_ERR_RESP_EN_M  (LP_TEE_BUS_ERR_RESP_EN_V << LP_TEE_BUS_ERR_RESP_EN_S)
#define LP_TEE_BUS_ERR_RESP_EN_V  0x00000001U
#define LP_TEE_BUS_ERR_RESP_EN_S  0

/** LP_TEE_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define LP_TEE_CLOCK_GATE_REG (DR_REG_LP_TEE_BASE + 0xf8)
/** LP_TEE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: Enable automatic clock gating
 *  1: Keep the clock always on
 */
#define LP_TEE_CLK_EN    (BIT(0))
#define LP_TEE_CLK_EN_M  (LP_TEE_CLK_EN_V << LP_TEE_CLK_EN_S)
#define LP_TEE_CLK_EN_V  0x00000001U
#define LP_TEE_CLK_EN_S  0

/** LP_TEE_DATE_REG register
 *  Version control register
 */
#define LP_TEE_DATE_REG (DR_REG_LP_TEE_BASE + 0xfc)
/** LP_TEE_DATE : R/W; bitpos: [27:0]; default: 2363416;
 *  Version control register.
 */
#define LP_TEE_DATE    0x0FFFFFFFU
#define LP_TEE_DATE_M  (LP_TEE_DATE_V << LP_TEE_DATE_S)
#define LP_TEE_DATE_V  0x0FFFFFFFU
#define LP_TEE_DATE_S  0

#ifdef __cplusplus
}
#endif
